; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph6 - mode
	thermograph3 - mode
	thermograph4 - mode
	infrared2 - mode
	image1 - mode
	image0 - mode
	image5 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image5)
	(supports instrument0 image1)
	(supports instrument0 image0)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Phenomenon7 spectrograph6)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 thermograph3)
	(have_image Star10 spectrograph6)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 thermograph3)
	(have_image Phenomenon12 thermograph4)
))

)

; plan
1. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 11
5. (take_image satellite0 phenomenon8 instrument0 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 1 of 11
6. (take_image satellite0 phenomenon8 instrument0 image0)
   added: (have_image phenomenon8 image0)
   goals met: 2 of 11
7. (turn_to satellite0 phenomenon7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon7 instrument0 spectrograph6)
   added: (have_image phenomenon7 spectrograph6)
   goals met: 3 of 11
9. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 11
10. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 11
11. (take_image satellite0 phenomenon12 instrument0 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 5 of 11
12. (take_image satellite0 phenomenon12 instrument0 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 6 of 11
13. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 11
14. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 7 of 11
15. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 11
16. (take_image satellite0 phenomenon9 instrument0 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 8 of 11
17. (turn_to satellite0 star10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star10)
   goals met: 9 of 11
18. (take_image satellite0 star10 instrument0 spectrograph6)
   added: (have_image star10 spectrograph6)
   goals met: 10 of 11
19. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 11 of 11
